Documents/ВыдачаСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВыдачаСИЗ</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказНаВыдачуСИЗ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыдачиСИЗПоНоменклатуре</xr:Item>
				<xr:Item>AccumulationRegister.СформированныеЗаказыНаВыдачуСИЗ</xr:Item>
				<xr:Item>AccumulationRegister.ВыданныеСИЗ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>// АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СИЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дежурное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПериодичностиВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследняяВыдача</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВыдачи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействиеСРанееВыданнымСИЗ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСИстекающимиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВыданныеСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыданныеСИЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ВыдачиСИЗПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыдачиСИЗПоНоменклатуре</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/СформированныеЗаказыНаВыдачуСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>СформированныеЗаказыНаВыдачуСИЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаВыдачуСИЗ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВыдачуСИЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ДействияСИстекающимиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияСИстекающимиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродлитьСрокНоски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыдачаСИЗ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнитьНаОснованииЗаказаНаВыдачуСИЗ(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	ИдентификаторыСтрокРабочихМест = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из РабочиеМеста Цикл
		ИдентификаторыСтрокРабочихМест.Вставить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста, СтрокаТаблицы);
	КонецЦикла;
	ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест);
	ЗаполнитьСформированныеЗаказыНаВыдачуСИЗ(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Для Индекс = 0 По РабочиеМеста.Количество()-1 Цикл
		СтрокаРабочееМесто = РабочиеМеста.Получить(Индекс);
		СтрокиНоменклатурыРабочегоМеста = НоменклатураСИЗ.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста));
		
		Для Каждого СтрокаНоменклатураСИЗ Из СтрокиНоменклатурыРабочегоМеста Цикл
			Если Не ЗначениеЗаполнено(СтрокаНоменклатураСИЗ.Номенклатура)
				И СтрокаНоменклатураСИЗ.РезультатВыдачи <> Перечисления.РезультатыВыдачиСИЗ.СрокНоскиПродлен Тогда
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Сотруднику ""%1"" не установлена номенклатура для выдачи по СИЗ ""%2""'"),
					СтрокаРабочееМесто.ФизическоеЛицо, СтрокаНоменклатураСИЗ.СИЗ);
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"РабочиеМеста", СтрокаРабочееМесто.НомерСтроки, "ФизическоеЛицо");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест)
	
	Для Каждого СтрокаТаблицы Из НоменклатураСИЗ Цикл
		Если СтрокаТаблицы.ДействиеСРанееВыданнымСИЗ = Перечисления.ДействияСИстекающимиСИЗ.ПродлитьСрокНоски Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = Движения.ВыданныеСИЗ.Добавить();
		ЗаписьНабора.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаписьНабора.Период = Дата;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
		ЗаписьНабора.ДокументВыдачи = Ссылка;
		ЗаписьНабора.ОснованиеВыдачи = СтрокаТаблицы.ОснованиеВыдачи;
		ЗаписьНабора.Количество = СтрокаТаблицы.Количество;
		ЗаписьНабора.Дежурное = СтрокаТаблицы.Дежурное;
		Движения.ВыданныеСИЗ.Записывать = Истина;
		
		ЗаписьНабора = Движения.ВыдачиСИЗПоНоменклатуре.Добавить();
		ЗаписьНабора.Период = Дата;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.РезультатВыдачи = СтрокаТаблицы.РезультатВыдачи;
		ЗаписьНабора.ОснованиеВыдачи = СтрокаТаблицы.ОснованиеВыдачи;
		ЗаписьНабора.ДокументВыдачи = Ссылка;
		ОписаниеПериодичности = СредстваИндивидуальнойЗащиты.ОписаниеПериодичностиВыдачи();
		ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, СтрокаТаблицы);
		ОписаниеПериодичности.Кратность = СтрокаТаблицы.КратностьВыдачи;
		ОписаниеПериодичности.Периодичность = СтрокаТаблицы.ПериодичностьВыдачи;
		ОписаниеПериодичности.ЕдиницаПериодичности = СтрокаТаблицы.ЕдиницаПериодичностиВыдачи;
		ЗаписьНабора.ДатаСледующейВыдачи = СредстваИндивидуальнойЗащиты.ДатаСледующейВыдачи(Дата, ОписаниеПериодичности);
		Движения.ВыдачиСИЗПоНоменклатуре.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСформированныеЗаказыНаВыдачуСИЗ(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест)
	
	Для Каждого СтрокаТаблицы Из НоменклатураСИЗ Цикл
		ЗаписьНабора = Движения.СформированныеЗаказыНаВыдачуСИЗ.Добавить();
		ЗаписьНабора.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаписьНабора.Период = Дата;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.ЗаказНаВыдачуСИЗ = СтрокаТаблицы.ОснованиеВыдачи;
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаТаблицы);
		Движения.СформированныеЗаказыНаВыдачуСИЗ.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаказаНаВыдачуСИЗ(ЗаказСсылка, СтандартнаяОбработка)
	
	Если ТипЗнч(ЗаказСсылка) <> Тип("ДокументСсылка.ЗаказНаВыдачуСИЗ") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
	Организация = ЗаказОбъект.Организация;
	Подразделение = ЗаказОбъект.Подразделение;
	
	ЗаполнитьЗначенияПоУмолчанию();
	ЗаполнитьСИЗТребующиеВыдачи(ЗаказОбъект.РабочиеМеста.Выгрузить(), "РабочееМесто", , Истина, ЗаказСсылка);
	
КонецПроцедуры

Процедура ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ЗаполнитьЗначенияПоУмолчанию();
	
	Если ДанныеЗаполнения.Свойство("ФизическиеЛицаРабочиеМеста") Тогда
		ЗаполнитьСИЗТребующиеВыдачи(ДанныеЗаполнения.ФизическиеЛицаРабочиеМеста, "РабочееМесто");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
	Ответственный = ЗначенияПоУмолчанию.Ответственный;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗ(ИдентификаторыСИЗ) Экспорт
	
	НоменклатураСИЗ.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивСИЗ = ИдентификаторыСИЗ.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивСИЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДанныеСИЗ Из МассивСИЗ Цикл
			НоваяСтрока = НоменклатураСИЗ.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСИЗ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗТребующиеВыдачи(ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, Сч = 1, ДобавлятьБезСИЗ = Ложь, ЗаказОснование = Неопределено) Экспорт
	
	ОтмеченныеСИЗ = Неопределено;
	ТаблицаФизическиеЛицаРабочиеМеста = СредстваИндивидуальнойЗащиты.ТаблицаФизическиеЛицаРабочиеМеста(
		ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, ОтмеченныеСИЗ);
	
	Если ТаблицаФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛицаСотрудников = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("ФизическоеЛицо");
	АнтропометрияФизическихЛиц = СредстваИндивидуальнойЗащиты.АнтропометрияФизическихЛиц(ФизическиеЛицаСотрудников);
	ДатаАктуальности = ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), КонецДня(ТекущаяДатаСеанса()));
	
	СИЗТребующиеВыдачи = СИЗТребующиеВыдачи(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности, ЗаказОснование, ОтмеченныеСИЗ);
	ТипыНоменклатурыСИЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		СИЗТребующиеВыдачи.ВыгрузитьКолонку("СИЗ"), "ТипНоменклатуры");
	РабочиеМестаСотрудников = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
	РеквизитыРабочихМест = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РабочиеМестаСотрудников, "Подразделение,Должность");
	Для Каждого ДанныеСИЗ Из ТаблицаФизическиеЛицаРабочиеМеста Цикл
		СИЗРабочихМест = СИЗТребующиеВыдачи.НайтиСтроки(
			Новый Структура("РабочееМесто, ФизическоеЛицо", ДанныеСИЗ.РабочееМесто, ДанныеСИЗ.ФизическоеЛицо));
		КоличествоСИЗ = СИЗРабочихМест.Количество();
		Если КоличествоСИЗ = 0 И Не ДобавлятьБезСИЗ Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = РабочиеМеста.Добавить();
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = Сч;
		Сч = Сч + 1;
		НоваяСтрока.ФизическоеЛицо = ДанныеСИЗ.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = ДанныеСИЗ.РабочееМесто;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыРабочихМест.Получить(НоваяСтрока.РабочееМесто));
		Если КоличествоСИЗ = 0 Тогда
			Продолжить;
		КонецЕсли;
		ПоследниеВыдачиСИЗ = СредстваИндивидуальнойЗащиты.ПоследниеВыдачиСИЗПоНоменклатуре(
			НоваяСтрока.ФизическоеЛицо, Организация, ДатаАктуальности);
		Для Каждого НайденныйСИЗ Из СИЗРабочихМест Цикл
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденныйСИЗ);
			НоваяСтрокаСИЗ.РезультатВыдачи = Перечисления.РезультатыВыдачиСИЗ.НеВыдано;
			АнтропометрияСотрудника = АнтропометрияФизическихЛиц.Получить(НоваяСтрока.ФизическоеЛицо);
			Если АнтропометрияСотрудника <> Неопределено Тогда
				НоваяСтрокаСИЗ.Размер = СредстваИндивидуальнойЗащиты.РазмерСотрудника(
					ТипыНоменклатурыСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ), АнтропометрияСотрудника);
			КонецЕсли;
			Если ПоследниеВыдачиСИЗ <> Неопределено Тогда
				ПоследняяВыдачаСИЗ = ПоследниеВыдачиСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ);
				Если ПоследняяВыдачаСИЗ <> Неопределено Тогда
					НоваяСтрокаСИЗ.ПоследняяВыдача = ПоследняяВыдачаСИЗ.Период;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = НоваяСтрока.ИдентификаторСтрокиРабочегоМеста;
		КонецЦикла;
	КонецЦикла;
	
	СредстваИндивидуальнойЗащиты.ПодобратьПодходящуюНоменклатуру(НоменклатураСИЗ);
	
КонецПроцедуры

Функция СИЗТребующиеВыдачи(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности, ЗаказОснование, ОтмеченныеСИЗ = Неопределено)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ТаблицаФизическиеЛицаРабочиеМеста, "ВТФизическиеЛицаРабочиеМеста");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("ЕстьОтмеченныеСИЗ", ЗначениеЗаполнено(ОтмеченныеСИЗ));
	Запрос.УстановитьПараметр("ОтмеченныеСИЗ", ОтмеченныеСИЗ);
	Запрос.УстановитьПараметр("ЕстьЗаказОснование", ЗначениеЗаполнено(ЗаказОснование));
	Запрос.УстановитьПараметр("ЗаказОснование", ЗаказОснование);
	Запрос.УстановитьПараметр("ТекущийРегистратор", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СформированныеЗаказы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СформированныеЗаказы.РабочееМесто КАК РабочееМесто,
		|	СформированныеЗаказы.ЗаказНаВыдачуСИЗ КАК ОснованиеВыдачи,
		|	СформированныеЗаказы.СИЗ КАК СИЗ,
		|	СформированныеЗаказы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СформированныеЗаказы.СпособВыдачи КАК СпособВыдачи,
		|	СформированныеЗаказы.Дежурное КАК Дежурное,
		|	СформированныеЗаказы.КратностьВыдачи КАК КратностьВыдачи,
		|	СформированныеЗаказы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	СформированныеЗаказы.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	СформированныеЗаказы.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ ВТСформированныеЗаказыНаВыдачуСИЗ
		|ИЗ
		|	РегистрНакопления.СформированныеЗаказыНаВыдачуСИЗ.Остатки(
		|			&ДатаАктуальности,
		|			ВЫБОР
		|					КОГДА &ЕстьОтмеченныеСИЗ
		|						ТОГДА СИЗ В (&ОтмеченныеСИЗ)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ЕстьЗаказОснование
		|						ТОГДА ЗаказНаВыдачуСИЗ = &ЗаказОснование
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК СформированныеЗаказы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СформированныеЗаказыНаВыдачуСИЗ.ФизическоеЛицо,
		|	СформированныеЗаказыНаВыдачуСИЗ.РабочееМесто,
		|	СформированныеЗаказыНаВыдачуСИЗ.ЗаказНаВыдачуСИЗ,
		|	СформированныеЗаказыНаВыдачуСИЗ.СИЗ,
		|	СформированныеЗаказыНаВыдачуСИЗ.ЕдиницаИзмерения,
		|	СформированныеЗаказыНаВыдачуСИЗ.СпособВыдачи,
		|	СформированныеЗаказыНаВыдачуСИЗ.Дежурное,
		|	СформированныеЗаказыНаВыдачуСИЗ.КратностьВыдачи,
		|	СформированныеЗаказыНаВыдачуСИЗ.ПериодичностьВыдачи,
		|	СформированныеЗаказыНаВыдачуСИЗ.ЕдиницаПериодичностиВыдачи,
		|	СформированныеЗаказыНаВыдачуСИЗ.Количество
		|ИЗ
		|	РегистрНакопления.СформированныеЗаказыНаВыдачуСИЗ КАК СформированныеЗаказыНаВыдачуСИЗ
		|ГДЕ
		|	СформированныеЗаказыНаВыдачуСИЗ.Регистратор = &ТекущийРегистратор
		|	И ВЫБОР
		|			КОГДА &ЕстьОтмеченныеСИЗ
		|				ТОГДА СформированныеЗаказыНаВыдачуСИЗ.СИЗ В (&ОтмеченныеСИЗ)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ЕстьЗаказОснование
		|				ТОГДА СформированныеЗаказыНаВыдачуСИЗ.ЗаказНаВыдачуСИЗ = &ЗаказОснование
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.РабочееМесто КАК РабочееМесто,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ОснованиеВыдачи КАК ОснованиеВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.СИЗ КАК СИЗ,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.СпособВыдачи КАК СпособВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.Дежурное КАК Дежурное,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.КратностьВыдачи КАК КратностьВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	СУММА(ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТСформированныеЗаказыНаВыдачуСИЗСгруппированные
		|ИЗ
		|	ВТСформированныеЗаказыНаВыдачуСИЗ КАК ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ФизическоеЛицо,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.РабочееМесто,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ОснованиеВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.СИЗ,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ЕдиницаИзмерения,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.СпособВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.Дежурное,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.КратностьВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ПериодичностьВыдачи,
		|	ВТОстаткиСформированныеЗаказыНаВыдачуСИЗ.ЕдиницаПериодичностиВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизическиеЛицаРабочиеМеста.РабочееМесто КАК РабочееМесто,
		|	ФизическиеЛицаРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СформированныеЗаказы.СИЗ КАК СИЗ,
		|	СформированныеЗаказы.ОснованиеВыдачи КАК ОснованиеВыдачи,
		|	СформированныеЗаказы.СпособВыдачи КАК СпособВыдачи,
		|	СформированныеЗаказы.Дежурное КАК Дежурное,
		|	СформированныеЗаказы.КратностьВыдачи КАК КратностьВыдачи,
		|	СформированныеЗаказы.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	СформированныеЗаказы.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	СформированныеЗаказы.Количество КАК Количество,
		|	СформированныеЗаказы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТФизическиеЛицаРабочиеМеста КАК ФизическиеЛицаРабочиеМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСформированныеЗаказыНаВыдачуСИЗСгруппированные КАК СформированныеЗаказы
		|		ПО ФизическиеЛицаРабочиеМеста.ФизическоеЛицо = СформированныеЗаказы.ФизическоеЛицо
		|			И ФизическиеЛицаРабочиеМеста.РабочееМесто = СформированныеЗаказы.РабочееМесто
		|			И (СформированныеЗаказы.Количество > 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	РабочееМесто,
		|	СИЗ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
